nxp-mcuxpresso/mcux-soc-svd/LPC865/LPC865.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ACOMP</name>
      <description>LPC86x analog comparator</description>
      <groupName>ACOMP</groupName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Comparator control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x6C03F58</resetMask>
          <fields>
            <field>
              <name>EDGESEL</name>
              <description>This field controls which edges on the comparator output set the COMPEDGE bit (bit 23 below):</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALLING_EDGES</name>
                  <description>Falling edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGES</name>
                  <description>Rising edges</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH_EDGES0</name>
                  <description>Both edges</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH_EDGES1</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPSA</name>
              <description>Comparator output control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPSA_0</name>
                  <description>Comparator output is used directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPSA_1</name>
                  <description>Comparator output is synchronized to the bus clock for output to other modules.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_VP_SEL</name>
              <description>Selects positive voltage input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOLTAGE_LADDER_OUTPUT</name>
                  <description>VOLTAGE_LADDER_OUTPUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I1</name>
                  <description>ACMP_I1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I2</name>
                  <description>ACMP_I2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I3</name>
                  <description>ACMP_I3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I4</name>
                  <description>ACMP_I4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I5</name>
                  <description>ACMP_I5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_GAP</name>
                  <description>Band gap. Internal reference voltage.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_VM_SEL</name>
              <description>Selects negative voltage input</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOLTAGE_LADDER_OUTPUT</name>
                  <description>VOLTAGE_LADDER_OUTPUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I1</name>
                  <description>ACMP_I1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I2</name>
                  <description>ACMP_I2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I3</name>
                  <description>ACMP_I3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I4</name>
                  <description>ACMP_I4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_I5</name>
                  <description>ACMP_I5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_GAP</name>
                  <description>Band gap. Internal reference voltage.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGECLR</name>
              <description>Interrupt clear bit. To clear the COMPEDGE bit and thus negate the interrupt request, toggle the EDGECLR bit by first writing a 1 and then a 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPSTAT</name>
              <description>Comparator status. This bit reflects the state of the comparator output.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEDGE</name>
              <description>Comparator edge-detect status.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTENA</name>
              <description>Must be set to generate interrupts.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS</name>
              <description>Controls the hysteresis of the comparator. When the comparator is outputting a certain state, this is the difference between the selected signals, in the opposite direction from the state being output, that will switch the output.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYS_0</name>
                  <description>None (the output will switch as the voltages cross)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_1</name>
                  <description>5 mv</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_2</name>
                  <description>10 mv</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_3</name>
                  <description>20 mv</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAD</name>
          <description>Voltage ladder register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LADEN</name>
              <description>Voltage ladder enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LADSEL</name>
              <description>Voltage ladder value. The reference voltage Vref depends on the LADREF bit below. 00000 = VSS 00001 = 1 x Vref/31 00010 = 2 x Vref/31 ... 11111 = Vref</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LADREF</name>
              <description>Selects the reference voltage Vref for the voltage ladder.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LADREF_0</name>
                  <description>Supply pin VDD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LADREF_1</name>
                  <description>VDDCMP pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
